; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l21_p21_c21_g21_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(crate-content crate18 medicine)
	(crate-content crate19 medicine)
	(crate-content crate20 medicine)
	(crate-content crate21 medicine)
	(at person1 loc14)
	(at person2 loc7)
	(at person3 loc5)
	(at person4 loc4)
	(at person5 loc4)
	(at person6 loc5)
	(at person7 loc16)
	(at person8 loc6)
	(at person9 loc20)
	(at person10 loc9)
	(at person11 loc4)
	(at person12 loc7)
	(at person13 loc19)
	(at person14 loc6)
	(at person15 loc7)
	(at person16 loc6)
	(at person17 loc9)
	(at person18 loc17)
	(at person19 loc11)
	(at person20 loc15)
	(at person21 loc14)
	(person-needs person1 medicine)
	(person-needs person2 food)
	(person-needs person2 medicine)
	(person-needs person3 food)
	(person-needs person3 medicine)
	(person-needs person4 food)
	(person-needs person7 food)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person11 food)
	(person-needs person12 food)
	(person-needs person14 food)
	(person-needs person14 medicine)
	(person-needs person15 food)
	(person-needs person15 medicine)
	(person-needs person16 food)
	(person-needs person16 medicine)
	(person-needs person19 food)
	(person-needs person20 food)
	(person-needs person20 medicine)
	(person-needs person21 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 food)
	(person-has person3 medicine)
	(person-has person4 food)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person11 food)
	(person-has person12 food)
	(person-has person14 food)
	(person-has person14 medicine)
	(person-has person15 food)
	(person-has person15 medicine)
	(person-has person16 food)
	(person-has person16 medicine)
	(person-has person19 food)
	(person-has person20 food)
	(person-has person20 medicine)
	(person-has person21 food)
	))
)

; plan
1. (grab-arm2 drone1 crate21 depot)
   deleted: (arm2-free drone1) (at crate21 depot)
   added: (arm2-load drone1 crate21)
   goals met: 1 of 22
2. (grab-arm1 drone1 crate14 depot)
   deleted: (arm1-free drone1) (at crate14 depot)
   added: (arm1-load drone1 crate14)
   goals met: 1 of 22
3. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 0 of 22
4. (deliver-arm1 drone1 person7 crate14 food loc16)
   deleted: (arm1-load drone1 crate14) (person-needs person7 food)
   added: (arm1-free drone1) (person-has person7 food)
   goals met: 1 of 22
5. (move-drone drone1 loc16 loc5)
   deleted: (at drone1 loc16)
   added: (at drone1 loc5)
   goals met: 1 of 22
6. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 2 of 22
7. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 2 of 22
8. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 1 of 22
9. (deliver-arm1 drone1 person9 crate13 food loc20)
   deleted: (arm1-load drone1 crate13) (person-needs person9 food)
   added: (arm1-free drone1) (person-has person9 food)
   goals met: 2 of 22
10. (move-drone drone1 loc20 loc5)
   deleted: (at drone1 loc20)
   added: (at drone1 loc5)
   goals met: 2 of 22
11. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 3 of 22
12. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 3 of 22
13. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 2 of 22
14. (deliver-arm1 drone1 person19 crate12 food loc11)
   deleted: (arm1-load drone1 crate12) (person-needs person19 food)
   added: (arm1-free drone1) (person-has person19 food)
   goals met: 3 of 22
15. (move-drone drone1 loc11 loc5)
   deleted: (at drone1 loc11)
   added: (at drone1 loc5)
   goals met: 3 of 22
16. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 4 of 22
17. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 4 of 22
18. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 3 of 22
19. (deliver-arm1 drone1 person3 crate11 food loc5)
   deleted: (arm1-load drone1 crate11) (person-needs person3 food)
   added: (arm1-free drone1) (person-has person3 food)
   goals met: 4 of 22
20. (deliver-arm2 drone1 person3 crate21 medicine loc5)
   deleted: (arm2-load drone1 crate21) (person-needs person3 medicine)
   added: (arm2-free drone1) (person-has person3 medicine)
   goals met: 5 of 22
21. (move-drone drone1 loc5 loc4)
   deleted: (at drone1 loc5)
   added: (at drone1 loc4)
   goals met: 5 of 22
22. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 6 of 22
23. (grab-arm2 drone1 crate20 depot)
   deleted: (arm2-free drone1) (at crate20 depot)
   added: (arm2-load drone1 crate20)
   goals met: 6 of 22
24. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 6 of 22
25. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 5 of 22
26. (deliver-arm1 drone1 person4 crate10 food loc4)
   deleted: (arm1-load drone1 crate10) (person-needs person4 food)
   added: (arm1-free drone1) (person-has person4 food)
   goals met: 6 of 22
27. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 7 of 22
28. (grab-arm1 drone1 crate9 depot)
   deleted: (arm1-free drone1) (at crate9 depot)
   added: (arm1-load drone1 crate9)
   goals met: 7 of 22
29. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 6 of 22
30. (deliver-arm1 drone1 person11 crate9 food loc4)
   deleted: (arm1-load drone1 crate9) (person-needs person11 food)
   added: (arm1-free drone1) (person-has person11 food)
   goals met: 7 of 22
31. (move-drone drone1 loc4 loc7)
   deleted: (at drone1 loc4)
   added: (at drone1 loc7)
   goals met: 7 of 22
32. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 8 of 22
33. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 8 of 22
34. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 7 of 22
35. (deliver-arm1 drone1 person2 crate8 food loc7)
   deleted: (arm1-load drone1 crate8) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 8 of 22
36. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 9 of 22
37. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 9 of 22
38. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 8 of 22
39. (deliver-arm2 drone1 person2 crate20 medicine loc7)
   deleted: (arm2-load drone1 crate20) (person-needs person2 medicine)
   added: (arm2-free drone1) (person-has person2 medicine)
   goals met: 9 of 22
40. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 10 of 22
41. (grab-arm2 drone1 crate19 depot)
   deleted: (arm2-free drone1) (at crate19 depot)
   added: (arm2-load drone1 crate19)
   goals met: 10 of 22
42. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 9 of 22
43. (deliver-arm1 drone1 person12 crate7 food loc7)
   deleted: (arm1-load drone1 crate7) (person-needs person12 food)
   added: (arm1-free drone1) (person-has person12 food)
   goals met: 10 of 22
44. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 11 of 22
45. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 11 of 22
46. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 10 of 22
47. (deliver-arm1 drone1 person15 crate6 food loc7)
   deleted: (arm1-load drone1 crate6) (person-needs person15 food)
   added: (arm1-free drone1) (person-has person15 food)
   goals met: 11 of 22
48. (deliver-arm2 drone1 person15 crate19 medicine loc7)
   deleted: (arm2-load drone1 crate19) (person-needs person15 medicine)
   added: (arm2-free drone1) (person-has person15 medicine)
   goals met: 12 of 22
49. (move-drone drone1 loc7 loc6)
   deleted: (at drone1 loc7)
   added: (at drone1 loc6)
   goals met: 12 of 22
50. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 13 of 22
51. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 13 of 22
52. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 13 of 22
53. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 12 of 22
54. (deliver-arm1 drone1 person8 crate5 food loc6)
   deleted: (arm1-load drone1 crate5) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 13 of 22
55. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 14 of 22
56. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 14 of 22
57. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 13 of 22
58. (deliver-arm1 drone1 person14 crate4 food loc6)
   deleted: (arm1-load drone1 crate4) (person-needs person14 food)
   added: (arm1-free drone1) (person-has person14 food)
   goals met: 14 of 22
59. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 15 of 22
60. (grab-arm1 drone1 crate3 depot)
   deleted: (arm1-free drone1) (at crate3 depot)
   added: (arm1-load drone1 crate3)
   goals met: 15 of 22
61. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 14 of 22
62. (deliver-arm2 drone1 person14 crate18 medicine loc6)
   deleted: (arm2-load drone1 crate18) (person-needs person14 medicine)
   added: (arm2-free drone1) (person-has person14 medicine)
   goals met: 15 of 22
63. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 16 of 22
64. (grab-arm2 drone1 crate17 depot)
   deleted: (arm2-free drone1) (at crate17 depot)
   added: (arm2-load drone1 crate17)
   goals met: 16 of 22
65. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 15 of 22
66. (deliver-arm1 drone1 person16 crate3 food loc6)
   deleted: (arm1-load drone1 crate3) (person-needs person16 food)
   added: (arm1-free drone1) (person-has person16 food)
   goals met: 16 of 22
67. (deliver-arm2 drone1 person16 crate17 medicine loc6)
   deleted: (arm2-load drone1 crate17) (person-needs person16 medicine)
   added: (arm2-free drone1) (person-has person16 medicine)
   goals met: 17 of 22
68. (move-drone drone1 loc6 loc15)
   deleted: (at drone1 loc6)
   added: (at drone1 loc15)
   goals met: 17 of 22
69. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 18 of 22
70. (grab-arm2 drone1 crate16 depot)
   deleted: (arm2-free drone1) (at crate16 depot)
   added: (arm2-load drone1 crate16)
   goals met: 18 of 22
71. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 18 of 22
72. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 17 of 22
73. (deliver-arm1 drone1 person20 crate2 food loc15)
   deleted: (arm1-load drone1 crate2) (person-needs person20 food)
   added: (arm1-free drone1) (person-has person20 food)
   goals met: 18 of 22
74. (deliver-arm2 drone1 person20 crate16 medicine loc15)
   deleted: (arm2-load drone1 crate16) (person-needs person20 medicine)
   added: (arm2-free drone1) (person-has person20 medicine)
   goals met: 19 of 22
75. (move-drone drone1 loc15 loc14)
   deleted: (at drone1 loc15)
   added: (at drone1 loc14)
   goals met: 19 of 22
76. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 20 of 22
77. (grab-arm2 drone1 crate15 depot)
   deleted: (arm2-free drone1) (at crate15 depot)
   added: (arm2-load drone1 crate15)
   goals met: 20 of 22
78. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 20 of 22
79. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 19 of 22
80. (deliver-arm2 drone1 person1 crate15 medicine loc14)
   deleted: (arm2-load drone1 crate15) (person-needs person1 medicine)
   added: (arm2-free drone1) (person-has person1 medicine)
   goals met: 20 of 22
81. (deliver-arm1 drone1 person21 crate1 food loc14)
   deleted: (arm1-load drone1 crate1) (person-needs person21 food)
   added: (arm1-free drone1) (person-has person21 food)
   goals met: 21 of 22
82. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 22 of 22
